run/tutorials/lagrangian/reactingParcelFoam/evaporationTest/constant/reactingCloud1Properties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      reactingCloud1Properties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solution
{
    active          true;
    coupled         true;
    transient       yes;
    cellValueSourceCorrection on;

    sourceTerms
    {
        schemes
        {
            rho             explicit 1;
            U               explicit 1;
            Yi              explicit 1;
            hs              explicit 1;
        }
    }

    interpolationSchemes
    {
        rho             cell;
        U               cellPoint;
        mu              cell;
        T               cell;
        Cp              cell;
        p               cell;
    }

    integrationSchemes
    {
        U               Euler;
        T               analytical;
    }
}


constantProperties
{
    parcelTypeId    1;

    rhoMin          1e-15;
    TMin            200;
    pMin            1000;
    minParticleMass 1e-15;

    rho0            1000;
    T0              300;
    Cp0             4187;

    youngsModulus   1e9;
    poissonsRatio   0.35;

    epsilon0        1;
    f0              0.5;
    Pr              0.7;
    Tvap            273;
    Tbp             373;

    constantVolume  false;
}


subModels
{
    particleForces
    {
    }

    injectionModel  manualInjection;

    dispersionModel none;

    patchInteractionModel standardWallInteraction;

    heatTransferModel none; // RanzMarshall;

    compositionModel singlePhaseMixture;

    phaseChangeModel none; // liquidEvaporation;

    surfaceFilmModel none;

    radiation       off;

    manualInjectionCoeffs
    {
        massTotal       1e-3;
        parcelBasisType mass;
        SOI             0;
        positionsFile   "reactingCloud1Positions";
        U0              ( 0 -0.1 0 );
        sizeDistribution
        {
            type        uniform;
            uniformDistribution
            {
                minValue        1e-04;
                maxValue        1e-04;
            }
        }
    }

    standardWallInteractionCoeffs
    {
        type            rebound;
    }

    RanzMarshallCoeffs
    {
        BirdCorrection  true;
    }

    singlePhaseMixtureCoeffs
    {
        phases
        (
            liquid
            {
                H2O          1;
            }
        );
    }

    liquidEvaporationCoeffs
    {
        enthalpyTransfer enthalpyDifference;

        activeLiquids    ( H2O );
    }
}


cloudFunctions
{
    particleErosion
    {
        p 2.7e9;
        patches (walls);
    }
}


// ************************************************************************* //
