run/tutorials/lagrangian/reactingParcelFoam/evaporationTest/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType      hsPsiMixtureThermo<reactingMixture<gasThermoPhysics>>;

chemistryReader foamChemistryReader;

foamChemistryFile "$FOAM_CASE/constant/foam.inp";

foamChemistryThermoFile "$FOAM_CASE/constant/foam.dat";

inertSpecie     N2;

liquids
{
    liquidComponents ( H2O );
    H2O
    {
        defaultCoeffs   yes;
    }
}

solids
{
    solidComponents ( );
}


// ************************************************************************* //
